{
  "history": [
    {
      "title": "Consultant IT",
      "employer": "CGI France",
      "date": "Depuis Octobre 2022",
      "description": "En mission chez la MGEN (Mutuelle Générale de l'Education Nationale) en tant qu'Ingénieur Dévéloppement Fullstack.\nActeur majeur de la protection sociale et première mutuelle de la fonction publique, la MGEN propose des offres de santé et de prévoyance adaptées aux besoins de ses adhérents, ainsi que\ndes solutions d’épargne, de retraite, d’assurance immobilier, de voyage et de protection juridique.\nPour répondre aux enjeux de la réforme de la Protection Sociale Complémentaire, entrant dans le cadre de la loi de\ntransformation de la fonction publique de 2019, la MGEN a opté pour l’emploi d’Activ’ Infinite, un progiciel assurance\ndéveloppé par l’éditeur de logiciels CEGEDIM, comme solution coeur pour la gestion de ses contrats collectifs et a confié à\nCGI la responsabilité d’intégrer le produit dans son système d’information.",
      "activities": [
        "Leader technique sur des sujets d'Architecture applicative, bonnes pratiques de développement, performance, expérience utilisateur, résolution de problèmes complexes, développement de prototypes et POCs, communication interfonctionnelle, amélioration des workflows, gestion de la documentation technique et formation des membres\n",
        "Développement des connecteurs permettant l’interfaçage entre le SI MGEN et le progiciel Activ’ Infinite (Microservices synchrones REST et asynchrones Kafka)",
        "Développement d'un système de suivi des événements et gestion des rejets métier avec IHM Angular",
        "Rédaction de tests unitaires et maintien de la qualité du code (SonarQube)",
        "Rédaction de spécifications techniques détaillées",
        "Conseil client sur la performance et l'ergonomie des produits",
        "Collaboration avec les équipes client et spécification des contrats d’interface entre les back-offices",
        "Assistance aux tests End-to-End",
        "Assistance à la recette",
        "Support aux équipes de développement client"
      ],
      "stack": [
        "Java 11",
        "Angular",
        "Spring Boot",
        "API REST",
        "Kafka",
        "JUnit",
        "Javascript",
        "Typescript",
        "Bootstrap",
        "PostGreSQL",
        "Maven",
        "SonarQube",
        "GitLab Pipelines",
        "Git",
        "npm",
        "Postman",
        "APIgee",
        "HP ALM Quality Center",
        "Jira"
      ]
    },
    {
      "title": "Ingénieur d'Études et Développement",
      "employer": "LCL",
      "date": "Septembre 2020 - Septembre 2022",
      "description": "Le Crédit Lyonnais, filiale du groupe Crédit Agricole SA et connue sous l'appellation LCL, est une banque française fondée à Lyon en 1863. Elle est considérée comme l'un des trois piliers de l'industrie bancaire française, avec BNP Paribas et Société Générale. LCL possède un Framework interne de développement conçu par l’entreprise, basé sur Spring et maintenu par l’équipe Framework dont j’étais membre. L’équipe fonctionne en support aux développeurs LCL mais aussi en projet, notamment sur le développement du portail des conseillers en agence.\n",
      "activities": [
        "Conception et développement d'applications fullstack Spring Boot/Angular",
        "Correction et évolution des applications métier",
        "Refontes intégrales de JSP/Servlet à Spring Boot/Angular",
        "Écriture de tests unitaires",
        "Rédaction de documentation technique",
        "Migration des projets vers Angular 13",
        "Activité de support de niveau 2 aux développeurs Java/Web LCL",
        "Veille technologique"
      ],
      "stack": [
        "Java 8/11",
        "Spring Boot",
        "JUnit",
        "Javascript",
        "Typescript",
        "Angular",
        "Bootstrap",
        "jQuery",
        "MongoDB",
        "PostGreSQL",
        "Maven",
        "SonarQube",
        "Jenkins",
        "Git",
        "npm",
        "Agile"
      ]
    },
    {
      "title": "Développeur SI",
      "employer": "GRTgaz",
      "date": "Octobre 2019 - Août 2020",
      "description": "GRTgaz, filiale du groupe ENGIE, est l’un des deux gestionnaires de réseau de transport de gaz en France. Pour faire face à la fin du support d’Oracle Utilities Application Framework, socle applicatif principal des applications métier GRTgaz, l’entreprise s’est lancée dans la refonte intégrale et progressive de son système d’information vente avec une organisation agile et une pile applicative innovante : le programme RIO (Refonte du SI de l’Offre).",
      "activities": [
        "Refonte d'applications métier en Spring Boot/Angular",
        "Développement d'une application de suivi des incidents en production",
        "Mise en place d'une stratégie d'API Management avec la solution Apigee",
        "Veille technologique"
      ],
      "stack": [
        "Java 11",
        "Spring Boot",
        "JavaScript",
        "Typescript",
        "Angular",
        "Maven",
        "Git",
        "npm",
        "Agile",
        "Amazon Web Services",
        "RESTful API Design",
        "Jira",
        "Confluence"
      ]
    }
  ]
}
